from itertools import combinations

place ={
"항구":['단봉','거북이등딱지','화승총','고무','녹슨검','고철','전신수영복','라이터','붕대','배터리','상자','감시카메라','올가미','유리병','식칼','빵','생라면','커피콩'],
"연못":['단봉','리본','단창','상자','대나무','꽃','망치','올가미','모자','쥐덫','곡괭이','거북이등딱지','손도끼','원석','팔찌','약초'],
"모래사장":['망치','올가미','발터PPK','쥐덫','곡괭이','피아노선','손도끼','거북이등딱지','쇠사슬','마패','자전거헬멧','원석','전신수영복','캔','쌍안경','탄산수'],
"고급주택가":['만년필','레이저포인터','바람막이','오일','손목시계','팔찌','운동화','꽃','리본','감시카메라','탄산수','피아노선','커피콩','위스키','카레가루','초콜렛','레몬'],
"골목길":['가위','라이터','쇠사슬','마패','바늘','접착제','전신수영복','팔찌','망치','운동화','붕대','쌍안경','고무','십자가','꿀','마늘'],
"호텔":['목장갑','피아노선','트럼프카드','고철','페도로프자동소총','옷감','식칼','철광석','발터PPK','바늘','얼음','바람막이','위스키','손목시계','탄산수','쌍안경','위스키','레몬'],
"번화가":['유리병','못','감시카메라','배터리','옷감','오일','만년필','트럼프카드','머리띠','캔','손목시계','초콜렛','슬리퍼','타이즈','부채','꿀','우유','초콜렛'],
"병원":['목장갑','고철','면도칼','레이저포인터','가위','알코올','바늘','접착제','붕대','슬리퍼','반창고','타이즈','얼음','깃털','감시카메라','우유','레몬'],
"절":['단봉','천갑옷','불경','대나무','마패','식칼','옷감','원석','단창','종이','머리띠','화약','승복','약초','마늘'],
"양궁장":['대나무','못','쇠구슬','고무','양궁','오일','모자','종이','승복','화약','천갑옷','달걀','운동화','녹슨검','감시카메라','초콜렛','올가미'],
"묘지":['너클','감시카메라','대나무','쥐덫','곡괭이','철광석','쇠사슬','화약','머리띠','마늘','천갑옷','달걀','깃털','얼음','꽃','커피콩'],
"숲":['너클','꽃','대나무','부채','쇠구슬','올가미','석궁','원석','화승총','철광석','곡괭이','달걀','단창','약초','타이즈','꿀','깃털'],
"공장":['쇠구슬','못','분필','고철','석궁','라이터','발터PPK','배터리','페도로프자동소총','알코올','손도끼','오일','야구공','접착제','쌍안경','생라면'],
"성당":['채찍','십자가','면도칼','성배','분필','피아노선','양궁','유리병','녹슨검','종이','자전거헬멧','빵','부채','위스키','상자','우유'],
"학교":['채찍','슬리퍼','면도칼','리본','분필','알코올','가위','감시카메라','만년필','레이저포인터','모자','라이터','자전거헬멧','캔','바람막이','빵','붕대']
}

item = {
"카른웬난":['식칼','꽃','십자가','성배'],
"파산검":['식칼','꽃','종이','라이터'],
"초진동나이프":['만년필','면도칼','고철','배터리','피아노선'],
"다마스커스가시":['만년필','면도칼','가위','쥐덫','못'],
"마하라자":['식칼','너클','거북이등딱지','깃털','꽃','트럼프카드'],
"뚜언띠엔":['녹슨검','고철','철광석','승복','거북이등딱지'],
"아론다이트":['녹슨검','고철','망치','오일','십자가'],
"엑스칼리버":['녹슨검','라이터','망치','원석','성배'],
"모노호시자오":['녹슨검','고철','망치','원석','만년필','종이'],
"호푸어드":['녹슨검','라이터','망치','원석','유리병','돌멩이'],
"빔엑스":['손도끼','대나무','고철','철광석','레이저포인터'],
"산타무에르테":['곡괭이','쇠사슬','단봉','망치','원석'],
"스퀴테":['곡괭이','쇠사슬','단봉','곡괭이','원석'],
"파라슈":['손도끼','대나무','깃털','불경','승복'],
"저거너트":['손도끼','대나무','깃털','배터리','피아노선','고철'],
"하르페":['손도끼','대나무','고철','철광석','단봉','깃털','발터PPK','리본'],
"이천일류":['식칼','녹슨검','만년필','종이','쥐덫','못'],
"디오스쿠로이":['가위','곡괭이','배터리','탄산수'],
"아수라":['식칼','녹슨검','만년필','종이','불경','승복'],
"로이거차르":['식칼','녹슨검','고철','망치','종이','라이터'],
"엘레강스":['발터PPK','레이저포인터','단봉','깃털'],
"일렉트론블라스터":['발터PPK','배터리','탄산수'],
"매그넘보아":['발터PPK','오일','만년필','종이','고철','철광석'],
"글록48":['발터PPK','레이저포인터','감시카메라','화약','배터리'],
"스탬피드":['발터PPK','피아노선','화약','곡괭이','원석'],
"개틀링건":['페도로프자동소총','화약','배터리','피아노선','고철'],
"아그니":['페도로프자동소총','화약','배터리','피아노선','고철','오일','라이터'],
"95식자동소총":['페도로프자동소총','화약','피아노선','고철','철광석'],
"AK12":['페도로프자동소총','화약','피아노선','유리병','접착제'],
"XCR":['페도로프자동소총','화약','상자','고철','망치'],
"Tac50":['화승총','레이저포인터','단창','만년필','종이'],
"인터벤션":['화승총','레이저포인터','단창','감시카메라','쌍안경'],
"NTW20":['화승총','레이저포인터','곡괭이','원석','고철','망치'],
"폴라리스":['화승총','레이저포인터','배터리','피아노선','분필'],
"단영촌천투":['목장갑','고철','철광석','거북이등딱지','리본','옷감'],
"디바인피스트":['목장갑','고철','철광석','화약','십자가'],
"블러드윙너클":['너클','철광석','망치','원석','깃털'],
"빙화현옥수":['목장갑','종이','라이터','얼음'],
"여래수투":['목장갑','종이','라이터','불경','승복'],
"브레이질건틀릿":['목장갑','고철','철광석','오일','붕대','거북이등딱지'],
"소수":['너클','철광석','유리병','분필'],
"택티컬톤파":['대나무','마패','만년필','종이'],
"마이쏙":['대나무','분필','단봉'],
"플라즈마톤파":['대나무','분필','레이저포인터'],
"낭아봉":['망치','단봉','쇠구슬','라이터'],
"다그다의망치":['망치','단봉','십자가','성배'],
"토르의망치":['망치','단봉','배터리','탄산수'],
"천근추":['망치','꽃','트럼프카드','불경','승복'],
"금강저":['단봉','고철','철광석','유리병','접착제'],
"구원의여신상":['단봉','오일','붕대','리본','옷감'],
"타구봉":['단봉','대나무','못','배터리','피아노선'],
"스파이의우산":['단봉','대나무','부채','종이','라이터'],
"활빈검":['바늘','철광석','승복','붕대','꽃','마패'],
"미스틸테인":['바늘','철광석','승복','붕대','꽃','마패'],
"레드펜서":['바늘','철광석','바늘','팔찌','쥐덫','못'],
"듀랜달Mk2":['바늘','철광석','꽃','트럼프카드','레이저포인터'],
"볼틱레토":['바늘','철광석','꽃','트럼프카드','배터리','피아노선'],
"에스프리":['바늘','바늘','철광석','석궁','페도로프자동소총'],
"애각창":['단창','대나무','깃털','분필'],
"장팔사모":['단창','대나무','깃털','배터리','탄산수'],
"트리아이나":['단창','대나무','식칼','단창','고철','철광석'],
"방천화극":['손도끼','단창','고철','철광석','부채','못'],
"청룡언월도":['손도끼','단창','고철','철광석','고철','망치'],
"편전":['양궁','고무','화약','마패','대나무'],
"골든래쇼보우":['양궁','피아노선','라이터','곡괭이','원석'],
"트윈보우":['양궁','피아노선','오일','양궁','고무','못'],
"제베의활":['양궁','고무','화약','대나무','단봉','깃털'],
"엘리멘탈보우":['양궁','고무','라이터','부채','못','깃털'],
"대황":['석궁','대나무','고철','망치','오일','붕대'],
"발리스타":['석궁','피아노선','고철','철광석','단창'],
"저격크로스보우":['석궁','대나무','레이저포인터','레이저포인터','쌍안경'],
"영광금귀신기노":['석궁','피아노선','고무','피아노선','화약','고철'],
"소이탄":['유리병','오일','쇠구슬','배터리'],
"다비드슬링":['야구공','만년필','고무','십자가','성배'],
"연막탄":['분필','유리병','오일','탄산수','꿀'],
"고폭수류탄":['쇠구슬','화약','피아노선','화약','고철'],
"안티오크의수류탄":['쇠구슬','화약','피아노선','화약','고철','십자가'],
"루테늄구슬":['고무','라이터','못','곡괭이','원석'],
"파이어볼":['야구공','만년필','쥐덫','화약','오일','붕대'],
"아스트라페":['단창','석궁','페도로프자동소총','유리병'],
"미치광이왕의카드":['트럼프카드','만년필','배터리','탄산수'],
"옥전결":['트럼프카드','만년필','분필','곡괭이','원석'],
"풍마수리검":['면도칼','십자가','꽃','알코올'],
"푸른색단도":['면도칼','십자가','꽃','종이','라이터'],
"플레솃":['바늘','깃털','고철','철광석','분필'],
"건곤권":['면도칼','피아노선','마패','불경','대나무'],
"보헤미안":['대나무','피아노선','배터리','망치','원석','트럼프카드'],
"천국의계단":['대나무','피아노선','곡괭이','원석','레이저포인터','쌍안경','성배'],
"퍼플헤이즈":['대나무','피아노선','곡괭이','원석','가위','종이','라이터'],
"새티스팩션":['대나무','피아노선','배터리','만년필','종이'],
"더월":['대나무','피아노선','배터리','대나무','분필'],
"틴스피릿":['대나무','피아노선','배터리','오일','불경','승복'],
"대소반룡곤":['쇠사슬','고철','못','종이','라이터'],
"초진동눈차크":['쇠사슬','고철','면도칼','배터리','피아노선','고철'],
"케르베로스":['쇠사슬','고철','못','타이즈','쇠사슬'],
"글레이프니르":['채찍','마패','깃털','쥐덫','못'],
"플라즈마윕":['채찍','면도칼','배터리','레이저포인터'],
"뇌룡편":['채찍','면도칼','배터리','곡괭이','원석'],
"미러리스":['렌즈','발터PPK','감시카메라','곡괭이','원석'],
"컴파운드사이트":['레이저포인터','쌍안경','손목시계','접착제','꽃'],
"카메라캐논":['렌즈','발터PPK','페도로프자동소총','상자','고철','망치'],
"VICG":['렌즈','발터PPK','만년필','종이','배터리','피아노선'],
"광학미채슈트":['전신수영복','고무','유리병','접착제'],
"락커의자켓":['바람막이','쇠사슬','캔','쇠구슬'],
"석양의갑옷":['천갑옷','쇠사슬','망치','원석'],
"성기사의갑옷":['천갑옷','고철','철광석','십자가','성배'],
"아마조네스아머":['천갑옷','고철','철광석','전신수영복','가위'],
"용의도복":['옷감','가위','면도칼','승복','거북이등딱지'],
"지휘관의갑옷":['천갑옷','쇠사슬','곡괭이','원석'],
"집사복":['바람막이','리본','단봉','깃털'],
"창파오":['옷감','가위','면도칼','알코올','유리병','꽃'],
"배틀슈트":['바람막이','고철','망치','전신수영복','고무'],
"EOD슈트":['바람막이','고철','망치','승복','붕대'],
"턱시도":['바람막이','리본','옷감','가위'],
"제사장의예복":['승복','붕대','꽃','라이터','얼음'],
"수정티아라":['머리띠','마패','유리병'],
"전술OPS헬멧":['모자','가위','자전거헬멧','배터리','피아노선'],
"기사단장의투구":['모자','쇠사슬','머리띠','깃털','고무'],
"제국왕관":['모자','가위','곡괭이','원석','원석'],
"황실부르고넷":['모자','쇠사슬','머리띠','깃털','곡괭이','원석'],
"모호크헬멧":['자전거헬멧','라이터','쥐덫','못'],
"비질란테":['자전거헬멧','라이터','쥐덫','철광석'],
"다이아뎀":['머리띠','꽃','피아노선','망치'],
"소드스토퍼":['붕대','고철','망치','못'],
"드라우프니르":['팔찌','곡괭이','원석','붕대'],
"바이탈센서":['손목시계','만년필','종이','배터리','피아노선'],
"레이더":['손목시계','만년필','종이','배터리','피아노선','유리병','접착제'],
"기사의신조":['거북이등딱지','고철','철광석','붕대','바늘'],
"샤자한의검집":['고철','망치','망치','원석'],
"아이기스":['팔찌','쥐덫','못','거북이등딱지'],
"틴달로스의팔찌":['팔찌','곡괭이','원석','손목시계','접착제'],
"나이팅게일":['붕대','바늘','약초','꽃','유리병'],
"플라즈마아크":['거북이등딱지','고철','철광석','배터리','피아노선'],
"스마트밴드":['꽃','피아노선','망치','만년필','종이'],
"경량화부츠":['운동화','오일','붕대','깃털'],
"타키온브레이스":['타이즈','접착제','배터리','피아노선','고철'],
"부케팔로스":['슬리퍼','고철','유리병','타이즈','쇠사슬'],
"클링온부츠":['운동화','오일','붕대','못'],
"풍화륜":['슬리퍼','옷감','종이','라이터'],
"매버릭러너":['운동화','쇠구슬','만년필','종이','배터리','피아노선'],
"EOD부츠":['운동화','오일','붕대','타이즈','접착제','고철','철광석'],
"백우선":['부채','못','깃털'],
"우치와":['리본','옷감','부채'],
"탄창":['상자','고철','망치'],
"궁기병의화살통":['대나무','단봉','깃털'],
"월왕구천":['녹슨검','마패','만년필','종이'],
"슈뢰딩거의상자":['상자','종이','라이터'],
"진리는나의빛":['불경','승복','십자가','성배'],
"해적의증표":['발터PPK','리본','식칼'],
"호크아이":['석궁','페도로프자동소총','레이저포인터','쌍안경'],
"오르골":['상자','배터리','피아노선','고철'],
"능동위장":['상자','망치','고철','바람막이'],
"마도서":['종이','꽃','트럼프카드'],
"해적깃발":['단봉','깃털','발터PPK','리본'],
"아이테르깃털":['깃털','꽃','트럼프카드']
}


makeItem = []
material = []
materialCount = {}
havingItem = []

while True:
    one_item = input('아이템의 이름을 입력해주세요. - 와 공백은 제거하고 입력해주세요.\nex) V.I.C.G = VICG, EOD 부츠 = EOD부츠\n더 이상 입력하지 않으면 0을 입력해주세요 : ')
    if one_item == '0':
        break
    if one_item in item.keys():
        makeItem.append(one_item)
    else:
        print("\n\n없는 아이템 입니다. 확인하고 다시 기입해주세요.")

# makeItem 에 있는 아이템들을 순회 하면서 하얀 아이템이 우선 몇개가 필요한지 센다.
for i in makeItem:
    for j in item[i]:
        if j not in materialCount:
            materialCount[j] = 1
        else:
            materialCount[j] += 1

while True:
    one_item = input('시작할 때 이미 가지고 있는 무기 아이템 / 탐색에서 제외할 노말 아이템을 넣어주세요. 빵, 물은 X\n더 이상 입력하지 않으려면 0을 입력해주세요 :')
    if one_item == '0':
        break
    if one_item not in materialCount.keys():
        print("\n\n그 아이템은 제작에 들어가지 않습니다.")
    else:
        materialCount[one_item] -= 1
        if materialCount[one_item] == 0:
            del materialCount[one_item]

print(materialCount)
for i in materialCount.keys():
    material.append(i)

print(material)

place_array = []
for i in place.keys():
    place_array.append(i)

real_route = []
count = 0
for i in range(8,3,-1):
    print(i)
    list_comb = list(combinations(place_array,i))
    count += len(list_comb)
    for one_place in list_comb:
        place_material_list = []
        for o in one_place:
            place_material_list += place[o]
        place_material_list = set(place_material_list)
        place_material_list = list(place_material_list)
        is_all_in_material = True
        for i in material:
            if i not in place_material_list:
                is_all_in_material = False
                break
        if is_all_in_material:
            real_route.append(one_place)
            print(one_place, end = '\n')
            for o in one_place:
                print(o, end = ' : ')
                for m in place[o]:
                    if m in materialCount.keys():
                        print(m + " " + str(materialCount[m]), end = ' ')
                print('')
            print('\n')
    print("\n")
print(materialCount)
